# Дана строка. Преобразовать в ней все строчные буквы в прописные и наоборот.

str1 = str(input('Введите вашу строку: '))

b = str1.swapcase()
print (b)